---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode
source: html/48baab3d-e12e-590a-41f1-5fb0418311af.htm
---
# ElectricalAnalyticalNode Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.